{
  "100001": {
    "description": "Failed login attempt",
    "cjis": ["5.6.2.2"],
    "nist": ["AC-7"],
    "policy_area": "Access Control"
  },
  "100002": {
    "description": "Audit log file modified or deleted",
    "cjis": ["5.3.4"],
    "nist": ["AU-9"],
    "policy_area": "Incident Response",
    "notes": "Alerts on modification or deletion of critical audit log files. Requires syscheck/FIM monitoring to be active."
  },
  "100003": {
    "description": "Unauthorized information sharing with mismatched access authorizations",
    "cjis": ["5.1.1"],
    "nist": ["AC-21"],
    "policy_area": "Information Exchange",
    "notes": "Trigger when information is shared with an external entity without proper access authorization match. Requires logging from collaboration or data governance tools."
  },
  "100004": {
    "description": "Unauthorized or unapproved software or component detected on monitored asset",
    "cjis": ["5.1.1"],
    "nist": ["SA-4"],
    "policy_area": "Information Exchange",
    "notes": "Supports acquisition controls by flagging unapproved systems or components. Requires integration with inventory/asset scanning or package management logs."
  },
  "100005": {
    "description": "Unauthorized access or change to the Information Security Program Plan (ISPP)",
    "cjis": ["5.1.1.1"],
    "nist": ["PM-1"],
    "policy_area": "Information Exchange",
    "notes": "Detects access or modification attempts to protected security program plan files. Supports PM-1 requirements for review, update, and protection of ISPP."
  },
  "100006": {
    "description": "Unauthorized access or change to the Incident Response Plan",
    "cjis": ["5.1.1.1"],
    "nist": ["IR-8"],
    "policy_area": "Information Exchange",
    "notes": "Fulfills IR-8 and CJIS 5.1.1.1 by ensuring unauthorized access or edits to the IR Plan are logged and alerted on. Supports confidentiality and change control."
  },
  "100007": {
    "description": "Access granted to user without signed or renewed access agreement",
    "cjis": ["5.1.1.7", "5.2.1.3"],
    "nist": ["PS-6"],
    "policy_area": "Information Exchange",
    "notes": "Validates that access is not provisioned without a signed access agreement. Log source must include access agreement status at user onboarding or provisioning time."
  },
  "100008": {
    "description": "User account provisioned without prior personnel screening",
    "cjis": ["5.1.1.7"],
    "nist": ["PS-3"],
    "policy_area": "Information Exchange",
    "notes": "Supports CJIS and PS-3 requirements by detecting unscreened individuals being granted access. Requires logs with `screening_status` or equivalent metadata from HR or IAM systems."
  },
  "100009": {
    "description": "Unauthorized or unlogged physical access attempt to a secure area",
    "cjis": ["5.1.1.7"],
    "nist": ["PE-3"],
    "policy_area": "Information Exchange",
    "notes": "Detects failed or unauthorized access attempts at secure physical locations. Requires logs from physical access systems, guards, or entry control mechanisms."
  },
  "100010": {
    "description": "System or organizational risk assessment is missing, outdated, or not reviewed as required",
    "cjis": ["5.1.2"],
    "nist": ["RA-3"],
    "policy_area": "Information Exchange",
    "notes": "Helps identify when required risk assessments have not been completed, updated, or reviewed. Requires logs from GRC, compliance, or risk tracking systems integrated into Wazuh."
  },
  "100011": {
    "description": "Gaps in continuous monitoring of system-level security or privacy metrics",
    "cjis": ["5.1.2"],
    "nist": ["CA-7"],
    "policy_area": "Information Exchange",
    "notes": "Supports CA-7 by detecting when critical metrics or control visibility is missing or broken. Requires metric coverage tracking via monitoring/logging systems integrated into Wazuh."
  },
  "100012": {
    "description": "User account created without acknowledging updated Rules of Behavior",
    "cjis": ["5.2.1"],
    "nist": ["PL-4"],
    "policy_area": "Security Awareness Training",
    "notes": "Detects account creation or access provisioning for users who have not signed off on the current Rules of Behavior. Requires acknowledgment tracking data from HR/IAM systems."
  },
  "100013": {
    "description": "Organizational credentials or sensitive data used on external websites or social media",
    "cjis": ["5.2.1"],
    "nist": ["PL-4(1)"],
    "policy_area": "Security Awareness Training",
    "notes": "Detects violations of acceptable use policy involving posting org data or using email/passwords on external sites. Requires logs from DLP, CASB, or email security tools integrated into Wazuh."
  },
  "100014": {
    "description": "Security or privacy literacy training is missing, outdated, or not completed by user",
    "cjis": ["5.2.1.1"],
    "nist": ["AT-2"],
    "policy_area": "Security Awareness Training",
    "notes": "Fulfills CJIS 5.2.1.1 by detecting overdue or missing training completions. Requires logs from the organization's security awareness training system or HR compliance tracking."
  },
  "100015": {
    "description": "Incident response training missing or overdue for user with response duties",
    "cjis": ["5.2.1.1"],
    "nist": ["IR-2"],
    "policy_area": "Security Awareness Training",
    "notes": "Triggers when incident response training has not been completed within expected timeframes. Supports IR-2 training compliance. Requires logs from HR or LMS."
  },
  "100016": {
    "description": "Role-based training not completed or overdue for user in a privileged or critical role",
    "cjis": ["5.2.1.1"],
    "nist": ["AT-3"],
    "policy_area": "Security Awareness Training",
    "notes": "Supports CJIS 5.2.1.1 and AT-3 by ensuring that access is not granted or retained without role-specific training. Requires integration with LMS, HR, or compliance system logging training status by role."
  },
  "100017": {
    "description": "Insider threat literacy training is missing or overdue for user",
    "cjis": ["5.2.1.2"],
    "nist": ["AT-2(2)"],
    "policy_area": "Security Awareness Training",
    "notes": "Detects if users have not completed insider threat awareness training within required timeframes. Requires training logs that specify topic and completion status."
  },
  "100018": {
    "description": "Identification and authentication policy or procedure documents are outdated or not reviewed as required",
    "cjis": ["5.2.1.3"],
    "nist": ["IA-1"],
    "policy_area": "Security Awareness Training",
    "notes": "Detects outdated I&A policies that have not been reviewed or disseminated according to frequency or trigger events. Requires GRC or documentation system logs that track review cycles."
  },
  "100019": {
    "description": "Security-relevant event was not reported to the incident response team or appropriate authority",
    "cjis": ["5.3.1"],
    "nist": ["IR-6"],
    "policy_area": "Incident Response",
    "notes": "Supports detection of report failures by flagging events that match threat criteria but lack associated reporting metadata. May require SIEM or case management system integration."
  },
  "100020": {
    "description": "Incident detected without triggering the organization's automated reporting mechanism",
    "cjis": ["5.3.1"],
    "nist": ["IR-6(1)"],
    "policy_area": "Incident Response",
    "notes": "Supports detection of reporting failures when automated mechanisms (e.g., email, ticket, SIEM integration) are expected but not engaged."
  },
  "100021": {
    "description": "Vulnerabilities related to an incident were not reported or documented properly",
    "cjis": ["5.3.1"],
    "nist": ["IR-6(2)"],
    "policy_area": "Incident Response",
    "notes": "Detects failure to associate or report vulnerabilities discovered during incident handling. Requires correlation between vulnerability management and IR systems."
  },
  "100022": {
    "description": "Incident response assistance was unavailable or not accessible during an active incident",
    "cjis": ["5.3.1.1.1"],
    "nist": ["IR-7"],
    "policy_area": "Incident Response",
    "notes": "Supports detection of IR assistance gaps by flagging when incidents are triggered without accessible or active IR support personnel. Requires metadata from ticketing systems or alert correlation pipelines indicating `ir_support.available`."
  },
  "100023": {
    "description": "Automated incident response assistance mechanism failed to initiate during event handling",
    "cjis": ["5.3.1.1.1"],
    "nist": ["IR-7(1)"],
    "policy_area": "Incident Response",
    "notes": "Flags failed automation in IR support processes, such as playbook execution failure, untriggered alerts, or broken chatops pipelines. Depends on logs with fields like `automation.status` and `event.type=ir_support_trigger`."
  },
  "100024": {
    "description": "Lack of coordination between internal incident response team and external support providers",
    "cjis": ["5.3.1.1.2"],
    "nist": ["IR-7(2)"],
    "policy_area": "Incident Response",
    "notes": "Detects whether formal coordination or contact listing between internal IR team and third-party response partners is in place. Depends on logs with `coordination.status` fields or relationship audit metadata."
  },
  "100025": {
    "description": "Incident response policy or associated procedures are outdated or not reviewed as required",
    "cjis": ["5.3.2"],
    "nist": ["IR-1"],
    "policy_area": "Incident Response",
    "notes": "Flags outdated or missing reviews of incident response policies. Requires compliance, audit, or GRC system logs that include document name and status (e.g., `incident_response`, `outdated`)."
  },
  "100026": {
    "description": "Incident response plan is missing, outdated, or not reviewed and distributed after key events",
    "cjis": ["5.3.2"],
    "nist": ["IR-8"],
    "policy_area": "Incident Response",
    "notes": "Ensures the IR plan is up to date, reviewed, and shared appropriately. Depends on logs that track plan status such as 'outdated', 'reviewed', or 'distributed' from audit or compliance systems."
  },
  "100027": {
    "description": "Automated incident handling process failed or was not executed as expected",
    "cjis": ["5.3.2.1"],
    "nist": ["IR-4(1)"],
    "policy_area": "Incident Response",
    "notes": "Flags failure of automated mechanisms that support incident handling. Depends on logs from SOAR/playbook systems or automation frameworks, showing `event.type=incident_automation` and `automation.status=failed`."
  },
  "100028": {
    "description": "Incident handling was incomplete or failed to integrate lessons learned into training and procedures",
    "cjis": ["5.3.2.1"],
    "nist": ["IR-4"],
    "policy_area": "Incident Response",
    "notes": "Flags when incidents do not follow through containment → eradication → recovery → review, or when corrective actions from lessons learned are not integrated. Relies on logs tagged with `incident_review` and lifecycle status metadata."
  },
  "100029": {
    "description": "Automated incident tracking or analysis mechanism failed or was not operating during incident activity",
    "cjis": ["5.3.2.1"],
    "nist": ["IR-5(1)"],
    "policy_area": "Incident Response",
    "notes": "Detects failures in automated incident tracking, metadata enrichment, or data analysis processes. Relies on logs with `event.type=incident_tracking` and fields such as `tracking.status=failed`."
  },
  "100030": {
    "description": "No continuity of operations actions were taken for a critical class incident",
    "cjis": ["5.3.2.1"],
    "nist": ["IR-4(3)"],
    "policy_area": "Incident Response",
    "notes": "Triggers when a critical incident type occurs and no continuity-of-operations procedures were marked as executed. Requires structured logging of `incident.class` and `coop.triggered` from response or orchestration tools."
  },
  "100031": {
    "description": "Incident was not correlated with other relevant events or responses, reducing awareness",
    "cjis": ["5.3.2.1"],
    "nist": ["IR-4(4)"],
    "policy_area": "Incident Response",
    "notes": "This rule detects incidents that were logged or responded to in isolation, without connection to similar events. It depends on correlation metadata such as `correlation.status=none` being included in logs."
  },
  "100032": {
    "description": "Dynamic reconfiguration actions were not performed for designated systems during incident response",
    "cjis": ["5.3.2.1"],
    "nist": ["IR-4(2)"],
    "policy_area": "Incident Response",
    "notes": "Identifies failures to perform live system changes (e.g., network re-routing, ACL updates, port blocking) as part of IR response. Depends on structured logs with `reconfiguration.status=not_performed` or similar tracking."
  },
  "100033": {
    "description": "An incident occurred without being formally tracked or documented in the incident response system",
    "cjis": ["5.3.2.1"],
    "nist": ["IR-5"],
    "policy_area": "Incident Response",
    "notes": "Fires when a qualifying incident event is detected but no documentation or tracking action has been logged. Requires structured logs with `documentation.status` fields or equivalent evidence of IR workflow gaps."
  },
  "100034": {
    "description": "Audit logs were not reviewed within defined frequency or failed to escalate on threat input",
    "cjis": ["5.3.2.2"],
    "nist": ["AU-6"],
    "policy_area": "Incident Response",
    "notes": "Detects missing or overdue audit record reviews, or failure to increase review cadence after risk events. Relies on structured review status logs such as `review.status=overdue` and `event.type=audit_review`."
  },
  "100035": {
    "description": "Incident response training was not completed within the defined time period after onboarding or role change",
    "cjis": ["5.3.3"],
    "nist": ["IR-2"],
    "policy_area": "Incident Response",
    "notes": "This rule detects overdue incident response training for personnel in security roles. Requires structured logs such as `training.topic=incident_response` and `training.status=overdue`."
  },
  "100036": {
    "description": "Incident response test was not performed on schedule per defined testing cadence",
    "cjis": ["5.3.3"],
    "nist": ["IR-3"],
    "policy_area": "Incident Response",
    "notes": "Flags missing or overdue incident response exercises. Depends on structured logs like `event.type=ir_test` and `test.status=overdue` or equivalent."
  },
  "100037": {
    "description": "Audit logs were not retained for the time period required by policy",
    "cjis": ["5.3.4"],
    "nist": ["AU-11"],
    "policy_area": "Incident Response",
    "notes": "Checks whether logs are expired or purged before required retention. Expects audit metadata with `retention.status=violation` emitted from review tooling or storage lifecycle audit jobs."
  },
  "100038": {
    "description": "Audit log entry is missing or includes non-compliant timestamp (unsynced clock or no UTC/offset)",
    "cjis": ["5.4.1"],
    "nist": ["AU-8"],
    "policy_area": "Auditing and Accountability",
    "notes": "Time stamps must be UTC-based or include offset, with granularity per policy. Assumes audit logs include `timestamp.status=invalid` when validation fails."
  },
  "100039": {
    "description": "Audit log storage capacity is insufficient for compliance with retention policy",
    "cjis": ["5.4.1"],
    "nist": ["AU-4"],
    "policy_area": "Auditing and Accountability",
    "notes": "Assumes log data or agent monitors storage usage on audit log volume or disk mount. Alert triggers when disk threshold or audit log space capacity exceeds defined limit."
  },
  "100040": {
    "description": "Unauthorized access, modification, or deletion of audit logs or logging tools detected",
    "cjis": ["5.4.1"],
    "nist": ["AU-9"],
    "policy_area": "Auditing and Accountability",
    "notes": "Requires file integrity or audit trail monitoring on log directories and logging tool config files. Assumes audit.result reflects tampering or unauthorized deletion events."
  },
  "100041": {
    "description": "Audit logs stored on the same physical system being audited (non-compliant with separation requirement)",
    "cjis": ["5.4.1"],
    "nist": ["AU-9(2)"],
    "policy_area": "Auditing and Accountability",
    "notes": "Assumes audit log storage path is observable and taggable via agent logs, config scans, or enrichment. Ideal with FIM or log forwarding configuration validation."
  },
  "100042": {
    "description": "Audit logging process failure occurred without triggering required alert or remediation actions",
    "cjis": ["5.4.1"],
    "nist": ["AU-5"],
    "policy_area": "Auditing and Accountability",
    "notes": "Requires visibility into audit subsystem failure logs and confirmation of alert/response action (via field like alert.sent). Must ensure logging pipelines report failure events clearly."
  },
  "100043": {
    "description": "Audit records indicating anomalies were not reviewed or reported to appropriate personnel",
    "cjis": ["5.4.1"],
    "nist": ["AU-6"],
    "policy_area": "Auditing and Accountability",
    "notes": "This rule depends on visibility into audit logs flagged as anomalous or containing suspicious indicators. Alerting logic must check for unreviewed anomalies or failures to notify designated parties. Adaptable via log enrichment pipelines or correlation engines."
  },
  "100044": {
    "description": "Audit log storage volume exceeded threshold without issuing warning",
    "cjis": ["5.4.1"],
    "nist": ["AU-5(1)"],
    "policy_area": "Auditing and Accountability",
    "notes": "This rule assumes audit log utilization is tracked and logged as a percentage value. Failure to trigger a warning at a predefined threshold (e.g., 90%) represents non-compliance with AU-5(1). Alert logic should verify both condition (percent full) and alert status."
  },
  "100045": {
    "description": "Unauthorized user performed audit logging configuration actions",
    "cjis": ["5.4.1"],
    "nist": ["AU-9(4)"],
    "policy_area": "Auditing and Accountability",
    "notes": "This rule enforces that only members of a defined privileged user subset (e.g., audit_admins) can make changes to audit logging systems. It relies on logs that include both the action and user role, such as sudo logs, auditd config changes, or Wazuh OSQuery data."
  },
  "100046": {
    "description": "Audit record missing one or more required fields (e.g., session ID, source IP)",
    "cjis": ["5.4.1"],
    "nist": ["AU-3(1)"],
    "policy_area": "Auditing and Accountability",
    "notes": "This rule ensures audit records contain all organization-defined fields like user.session_id or src.ip. Triggered if logs are missing these contextual attributes. Enrichment may be required from endpoint agents or decoders."
  },
  "100047": {
    "description": "Audit logging failure triggered a real-time alert to designated personnel",
    "cjis": ["5.4.1"],
    "nist": ["AU-5(2)"],
    "policy_area": "Auditing and Accountability",
    "notes": "This rule ensures real-time alerts are generated when audit logging systems fail. Requires error capture from Wazuh modules or log daemons, and alerting must occur within organization-defined timeframes."
  },
  "100048": {
    "description": "Log entry missing required audit context fields such as event type, source, timestamp, actor, and result.",
    "cjis": ["5.4.1"],
    "nist": ["AU-3"],
    "policy_area": "Auditing and Accountability",
    "notes": "This rule detects incomplete audit entries, ensuring logs capture all required elements for compliance and forensic auditability. Relies on decoder validation or context-enrichment mechanisms to flag incompleteness."
  },
  "100049": {
    "description": "User was not presented with previous logon date/time at successful authentication.",
    "cjis": ["5.4.1"],
    "nist": ["AC-9"],
    "policy_area": "Auditing and Accountability",
    "notes": "Detects absence of user notification for prior logon on successful login events. Assumes log stream includes or can be enriched with a `last_logon.notified` boolean or corresponding event entry."
  },
  "100050": {
    "description": "Audit records are not being generated for required event types or components per AU-2 and AU-3 specifications.",
    "cjis": ["5.4.1"],
    "nist": ["AU-12"],
    "policy_area": "Auditing and Accountability",
    "notes": "Verifies audit record generation is active for defined event types. Assumes enrichment field `event.audit_generated` exists or equivalent detection method is in place."
  },
  "100051": {
    "description": "Audit records are not being correlated across repositories, limiting situational awareness across systems.",
    "cjis": ["5.4.1"],
    "nist": ["AU-6(3)"],
    "policy_area": "Auditing and Accountability",
    "notes": "Assumes enrichment field `audit.repo_count` is present to track whether logs are unified from multiple sources. Integration should support multi-source audit aggregation."
  },
  "100052": {
    "description": "Remote access is not being monitored through automated means, violating CJIS remote session control guidance.",
    "cjis": ["5.4.1.1"],
    "nist": ["AC-17(1)"],
    "policy_area": "Auditing and Accountability",
    "notes": "Triggers if remote access sessions are detected but no active monitoring service is confirmed. Assumes telemetry on remote access events and monitoring state is available."
  },
  "100053": {
    "description": "System monitoring failed to detect unauthorized activity or anomalies, violating CJIS system oversight obligations.",
    "cjis": ["5.4.1.1"],
    "nist": ["SI-4"],
    "policy_area": "Auditing and Accountability",
    "notes": "This rule assumes integration with behavioral analysis or alerting platforms that flag monitoring effectiveness. Triggered when detection fails against expected threats or conditions."
  },
  "100054": {
    "description": "Continuous monitoring is not active or lacks strategy compliance, violating CJIS 5.4.3.",
    "cjis": ["5.4.3"],
    "nist": ["CA-7"],
    "policy_area": "Auditing and Accountability",
    "notes": "Rule detects gaps in continuous monitoring plans or scheduled system metric reporting. Assumes event fields or telemetry can show monitoring status."
  },
  "100055": {
    "description": "System is missing critical audit event types required by CJIS 5.4.3, compromising forensic readiness.",
    "cjis": ["5.4.3"],
    "nist": ["AU-2"],
    "policy_area": "Auditing and Accountability",
    "notes": "Triggers when audit logs lack required categories (e.g., authentication, privilege use). Requires log inspection or config scan."
  },
  "100056": {
    "description": "Account lifecycle events (create, modify, disable, delete) are not audited, violating CJIS 5.4.1.1 and NIST AC-2(4).",
    "cjis": ["5.4.1.1"],
    "nist": ["AC-2(4)"],
    "policy_area": "Auditing and Accountability",
    "notes": "Monitors for automated logging of user account management events. Assumes normalized audit fields (e.g., audit.account.create). Requires log coverage across identity/auth sources (Active Directory, auditd, etc)."
  },
  "100057": {
    "description": "Audit record review and reporting are not integrated using automated mechanisms, as required by CJIS 5.4.3 and NIST AU-6(1).",
    "cjis": ["5.4.3"],
    "nist": ["AU-6(1)"],
    "policy_area": "Auditing and Accountability",
    "notes": "Triggers when logs are being collected but are not integrated into an automated process for audit review and reporting. Supports detection of compliance gaps in environments lacking SIEM, scheduled analysis, or Wazuh integration logic."
  },
  "100058": {
    "description": "Audit record reduction or report generation is not implemented or alters original logs, violating CJIS 5.4.3 and AU-7.",
    "cjis": ["5.4.3"],
    "nist": ["AU-7"],
    "policy_area": "Auditing and Accountability",
    "notes": "This rule detects environments where either (a) no reporting interface is available for audit review, or (b) audit data is manipulated during log reduction in ways that prevent accurate event reconstruction. Requires logging platform to support filtered views while preserving raw event integrity."
  },
  "100059": {
    "description": "Audit logs are not retained for the required duration per organizational or regulatory policy, in violation of CJIS 5.4.3 / AU-11.",
    "cjis": ["5.4.3"],
    "nist": ["AU-11"],
    "policy_area": "Auditing and Accountability",
    "notes": "This rule checks for inadequate audit retention settings, typically defined by `audit.retention.days`. CJIS typically requires logs to be retained for sufficient time to enable after-the-fact investigation, legal discovery, and compliance reviews. This threshold should match agency policy and legal obligations."
  },
}
