{
  "100001": {
    "description": "Failed login attempt",
    "cjis": ["5.6.2.2"],
    "nist": ["AC-7"],
    "policy_area": "Access Control"
  },
  "100002": {
    "description": "Audit log file modified or deleted",
    "cjis": ["5.3.4"],
    "nist": ["AU-9"],
    "policy_area": "Incident Response",
    "notes": "Alerts on modification or deletion of critical audit log files. Requires syscheck/FIM monitoring to be active."
  },
  "100003": {
    "description": "Unauthorized information sharing with mismatched access authorizations",
    "cjis": ["5.1.1"],
    "nist": ["AC-21"],
    "policy_area": "Information Exchange",
    "notes": "Trigger when information is shared with an external entity without proper access authorization match. Requires logging from collaboration or data governance tools."
  },
  "100004": {
    "description": "Unauthorized or unapproved software or component detected on monitored asset",
    "cjis": ["5.1.1"],
    "nist": ["SA-4"],
    "policy_area": "Information Exchange",
    "notes": "Supports acquisition controls by flagging unapproved systems or components. Requires integration with inventory/asset scanning or package management logs."
  },
  "100005": {
    "description": "Unauthorized access or change to the Information Security Program Plan (ISPP)",
    "cjis": ["5.1.1.1"],
    "nist": ["PM-1"],
    "policy_area": "Information Exchange",
    "notes": "Detects access or modification attempts to protected security program plan files. Supports PM-1 requirements for review, update, and protection of ISPP."
  },
  "100006": {
    "description": "Unauthorized access or change to the Incident Response Plan",
    "cjis": ["5.1.1.1"],
    "nist": ["IR-8"],
    "policy_area": "Information Exchange",
    "notes": "Fulfills IR-8 and CJIS 5.1.1.1 by ensuring unauthorized access or edits to the IR Plan are logged and alerted on. Supports confidentiality and change control."
  },
  "100007": {
    "description": "Access granted to user without signed or renewed access agreement",
    "cjis": ["5.1.1.7", "5.2.1.3"],
    "nist": ["PS-6"],
    "policy_area": "Information Exchange",
    "notes": "Validates that access is not provisioned without a signed access agreement. Log source must include access agreement status at user onboarding or provisioning time."
  },
  "100008": {
    "description": "User account provisioned without prior personnel screening",
    "cjis": ["5.1.1.7"],
    "nist": ["PS-3"],
    "policy_area": "Information Exchange",
    "notes": "Supports CJIS and PS-3 requirements by detecting unscreened individuals being granted access. Requires logs with `screening_status` or equivalent metadata from HR or IAM systems."
  },
  "100009": {
    "description": "Unauthorized or unlogged physical access attempt to a secure area",
    "cjis": ["5.1.1.7"],
    "nist": ["PE-3"],
    "policy_area": "Information Exchange",
    "notes": "Detects failed or unauthorized access attempts at secure physical locations. Requires logs from physical access systems, guards, or entry control mechanisms."
  },
  "100010": {
    "description": "System or organizational risk assessment is missing, outdated, or not reviewed as required",
    "cjis": ["5.1.2"],
    "nist": ["RA-3"],
    "policy_area": "Information Exchange",
    "notes": "Helps identify when required risk assessments have not been completed, updated, or reviewed. Requires logs from GRC, compliance, or risk tracking systems integrated into Wazuh."
  },
  "100011": {
    "description": "Gaps in continuous monitoring of system-level security or privacy metrics",
    "cjis": ["5.1.2"],
    "nist": ["CA-7"],
    "policy_area": "Information Exchange",
    "notes": "Supports CA-7 by detecting when critical metrics or control visibility is missing or broken. Requires metric coverage tracking via monitoring/logging systems integrated into Wazuh."
  },
  "100012": {
    "description": "User account created without acknowledging updated Rules of Behavior",
    "cjis": ["5.2.1"],
    "nist": ["PL-4"],
    "policy_area": "Security Awareness Training",
    "notes": "Detects account creation or access provisioning for users who have not signed off on the current Rules of Behavior. Requires acknowledgment tracking data from HR/IAM systems."
  },
  "100013": {
    "description": "Organizational credentials or sensitive data used on external websites or social media",
    "cjis": ["5.2.1"],
    "nist": ["PL-4(1)"],
    "policy_area": "Security Awareness Training",
    "notes": "Detects violations of acceptable use policy involving posting org data or using email/passwords on external sites. Requires logs from DLP, CASB, or email security tools integrated into Wazuh."
  },
  "100014": {
    "description": "Security or privacy literacy training is missing, outdated, or not completed by user",
    "cjis": ["5.2.1.1"],
    "nist": ["AT-2"],
    "policy_area": "Security Awareness Training",
    "notes": "Fulfills CJIS 5.2.1.1 by detecting overdue or missing training completions. Requires logs from the organization's security awareness training system or HR compliance tracking."
  },
  "100015": {
    "description": "Incident response training missing or overdue for user with response duties",
    "cjis": ["5.2.1.1"],
    "nist": ["IR-2"],
    "policy_area": "Security Awareness Training",
    "notes": "Triggers when incident response training has not been completed within expected timeframes. Supports IR-2 training compliance. Requires logs from HR or LMS."
  },
  "100016": {
    "description": "Role-based training not completed or overdue for user in a privileged or critical role",
    "cjis": ["5.2.1.1"],
    "nist": ["AT-3"],
    "policy_area": "Security Awareness Training",
    "notes": "Supports CJIS 5.2.1.1 and AT-3 by ensuring that access is not granted or retained without role-specific training. Requires integration with LMS, HR, or compliance system logging training status by role."
  },
  "100017": {
    "description": "Insider threat literacy training is missing or overdue for user",
    "cjis": ["5.2.1.2"],
    "nist": ["AT-2(2)"],
    "policy_area": "Security Awareness Training",
    "notes": "Detects if users have not completed insider threat awareness training within required timeframes. Requires training logs that specify topic and completion status."
  },
  "100018": {
    "description": "Identification and authentication policy or procedure documents are outdated or not reviewed as required",
    "cjis": ["5.2.1.3"],
    "nist": ["IA-1"],
    "policy_area": "Security Awareness Training",
    "notes": "Detects outdated I&A policies that have not been reviewed or disseminated according to frequency or trigger events. Requires GRC or documentation system logs that track review cycles."
  },
  "100019": {
    "description": "Security-relevant event was not reported to the incident response team or appropriate authority",
    "cjis": ["5.3.1"],
    "nist": ["IR-6"],
    "policy_area": "Incident Response",
    "notes": "Supports detection of report failures by flagging events that match threat criteria but lack associated reporting metadata. May require SIEM or case management system integration."
  },
  "100020": {
    "description": "Incident detected without triggering the organization's automated reporting mechanism",
    "cjis": ["5.3.1"],
    "nist": ["IR-6(1)"],
    "policy_area": "Incident Response",
    "notes": "Supports detection of reporting failures when automated mechanisms (e.g., email, ticket, SIEM integration) are expected but not engaged."
  },
  "100021": {
    "description": "Vulnerabilities related to an incident were not reported or documented properly",
    "cjis": ["5.3.1"],
    "nist": ["IR-6(2)"],
    "policy_area": "Incident Response",
    "notes": "Detects failure to associate or report vulnerabilities discovered during incident handling. Requires correlation between vulnerability management and IR systems."
  },
  "100022": {
    "description": "Incident response assistance was unavailable or not accessible during an active incident",
    "cjis": ["5.3.1.1.1"],
    "nist": ["IR-7"],
    "policy_area": "Incident Response",
    "notes": "Supports detection of IR assistance gaps by flagging when incidents are triggered without accessible or active IR support personnel. Requires metadata from ticketing systems or alert correlation pipelines indicating `ir_support.available`."
  },
  "100023": {
    "description": "Automated incident response assistance mechanism failed to initiate during event handling",
    "cjis": ["5.3.1.1.1"],
    "nist": ["IR-7(1)"],
    "policy_area": "Incident Response",
    "notes": "Flags failed automation in IR support processes, such as playbook execution failure, untriggered alerts, or broken chatops pipelines. Depends on logs with fields like `automation.status` and `event.type=ir_support_trigger`."
  },
  "100024": {
    "description": "Lack of coordination between internal incident response team and external support providers",
    "cjis": ["5.3.1.1.2"],
    "nist": ["IR-7(2)"],
    "policy_area": "Incident Response",
    "notes": "Detects whether formal coordination or contact listing between internal IR team and third-party response partners is in place. Depends on logs with `coordination.status` fields or relationship audit metadata."
  },
  "100025": {
    "description": "Incident response policy or associated procedures are outdated or not reviewed as required",
    "cjis": ["5.3.2"],
    "nist": ["IR-1"],
    "policy_area": "Incident Response",
    "notes": "Flags outdated or missing reviews of incident response policies. Requires compliance, audit, or GRC system logs that include document name and status (e.g., `incident_response`, `outdated`)."
  },
  "100026": {
    "description": "Incident response plan is missing, outdated, or not reviewed and distributed after key events",
    "cjis": ["5.3.2"],
    "nist": ["IR-8"],
    "policy_area": "Incident Response",
    "notes": "Ensures the IR plan is up to date, reviewed, and shared appropriately. Depends on logs that track plan status such as 'outdated', 'reviewed', or 'distributed' from audit or compliance systems."
  },
}
