{
  "100001": {
    "description": "Failed login attempt",
    "cjis": ["5.6.2.2"],
    "nist": ["AC-7"],
    "policy_area": "Access Control"
  },
  "100002": {
    "description": "Audit log file modified or deleted",
    "cjis": ["5.3.4"],
    "nist": ["AU-9"],
    "policy_area": "Incident Response",
    "notes": "Alerts on modification or deletion of critical audit log files. Requires syscheck/FIM monitoring to be active."
  },
  "100003": {
    "description": "Unauthorized information sharing with mismatched access authorizations",
    "cjis": ["5.1.1"],
    "nist": ["AC-21"],
    "policy_area": "Information Exchange",
    "notes": "Trigger when information is shared with an external entity without proper access authorization match. Requires logging from collaboration or data governance tools."
  },
  "100004": {
    "description": "Unauthorized or unapproved software or component detected on monitored asset",
    "cjis": ["5.1.1"],
    "nist": ["SA-4"],
    "policy_area": "Information Exchange",
    "notes": "Supports acquisition controls by flagging unapproved systems or components. Requires integration with inventory/asset scanning or package management logs."
  },
  "100005": {
    "description": "Unauthorized access or change to the Information Security Program Plan (ISPP)",
    "cjis": ["5.1.1.1"],
    "nist": ["PM-1"],
    "policy_area": "Information Exchange",
    "notes": "Detects access or modification attempts to protected security program plan files. Supports PM-1 requirements for review, update, and protection of ISPP."
  },
  "100006": {
    "description": "Unauthorized access or change to the Incident Response Plan",
    "cjis": ["5.1.1.1"],
    "nist": ["IR-8"],
    "policy_area": "Information Exchange",
    "notes": "Fulfills IR-8 and CJIS 5.1.1.1 by ensuring unauthorized access or edits to the IR Plan are logged and alerted on. Supports confidentiality and change control."
  },
  "100007": {
    "description": "Access granted to user without signed or renewed access agreement",
    "cjis": ["5.1.1.7", "5.2.1.3"],
    "nist": ["PS-6"],
    "policy_area": "Information Exchange",
    "notes": "Validates that access is not provisioned without a signed access agreement. Log source must include access agreement status at user onboarding or provisioning time."
  },
  "100008": {
    "description": "User account provisioned without prior personnel screening",
    "cjis": ["5.1.1.7"],
    "nist": ["PS-3"],
    "policy_area": "Information Exchange",
    "notes": "Supports CJIS and PS-3 requirements by detecting unscreened individuals being granted access. Requires logs with `screening_status` or equivalent metadata from HR or IAM systems."
  },
  "100009": {
    "description": "Unauthorized or unlogged physical access attempt to a secure area",
    "cjis": ["5.1.1.7"],
    "nist": ["PE-3"],
    "policy_area": "Information Exchange",
    "notes": "Detects failed or unauthorized access attempts at secure physical locations. Requires logs from physical access systems, guards, or entry control mechanisms."
  },
  "100010": {
    "description": "System or organizational risk assessment is missing, outdated, or not reviewed as required",
    "cjis": ["5.1.2"],
    "nist": ["RA-3"],
    "policy_area": "Information Exchange",
    "notes": "Helps identify when required risk assessments have not been completed, updated, or reviewed. Requires logs from GRC, compliance, or risk tracking systems integrated into Wazuh."
  },
  "100011": {
    "description": "Gaps in continuous monitoring of system-level security or privacy metrics",
    "cjis": ["5.1.2"],
    "nist": ["CA-7"],
    "policy_area": "Information Exchange",
    "notes": "Supports CA-7 by detecting when critical metrics or control visibility is missing or broken. Requires metric coverage tracking via monitoring/logging systems integrated into Wazuh."
  },
  "100012": {
    "description": "User account created without acknowledging updated Rules of Behavior",
    "cjis": ["5.2.1"],
    "nist": ["PL-4"],
    "policy_area": "Security Awareness Training",
    "notes": "Detects account creation or access provisioning for users who have not signed off on the current Rules of Behavior. Requires acknowledgment tracking data from HR/IAM systems."
  },
  "100013": {
    "description": "Organizational credentials or sensitive data used on external websites or social media",
    "cjis": ["5.2.1"],
    "nist": ["PL-4(1)"],
    "policy_area": "Security Awareness Training",
    "notes": "Detects violations of acceptable use policy involving posting org data or using email/passwords on external sites. Requires logs from DLP, CASB, or email security tools integrated into Wazuh."
  },
  "100014": {
    "description": "Security or privacy literacy training is missing, outdated, or not completed by user",
    "cjis": ["5.2.1.1"],
    "nist": ["AT-2"],
    "policy_area": "Security Awareness Training",
    "notes": "Fulfills CJIS 5.2.1.1 by detecting overdue or missing training completions. Requires logs from the organization's security awareness training system or HR compliance tracking."
  },
  "100015": {
    "description": "Incident response training missing or overdue for user with response duties",
    "cjis": ["5.2.1.1"],
    "nist": ["IR-2"],
    "policy_area": "Security Awareness Training",
    "notes": "Triggers when incident response training has not been completed within expected timeframes. Supports IR-2 training compliance. Requires logs from HR or LMS."
  },
  "100016": {
    "description": "Role-based training not completed or overdue for user in a privileged or critical role",
    "cjis": ["5.2.1.1"],
    "nist": ["AT-3"],
    "policy_area": "Security Awareness Training",
    "notes": "Supports CJIS 5.2.1.1 and AT-3 by ensuring that access is not granted or retained without role-specific training. Requires integration with LMS, HR, or compliance system logging training status by role."
  },
  "100017": {
    "description": "Insider threat literacy training is missing or overdue for user",
    "cjis": ["5.2.1.2"],
    "nist": ["AT-2(2)"],
    "policy_area": "Security Awareness Training",
    "notes": "Detects if users have not completed insider threat awareness training within required timeframes. Requires training logs that specify topic and completion status."
  },
  "100018": {
    "description": "Identification and authentication policy or procedure documents are outdated or not reviewed as required",
    "cjis": ["5.2.1.3"],
    "nist": ["IA-1"],
    "policy_area": "Security Awareness Training",
    "notes": "Detects outdated I&A policies that have not been reviewed or disseminated according to frequency or trigger events. Requires GRC or documentation system logs that track review cycles."
  },
  "100019": {
    "description": "Security-relevant event was not reported to the incident response team or appropriate authority",
    "cjis": ["5.3.1"],
    "nist": ["IR-6"],
    "policy_area": "Incident Response",
    "notes": "Supports detection of report failures by flagging events that match threat criteria but lack associated reporting metadata. May require SIEM or case management system integration."
  },
  "100020": {
    "description": "Incident detected without triggering the organization's automated reporting mechanism",
    "cjis": ["5.3.1"],
    "nist": ["IR-6(1)"],
    "policy_area": "Incident Response",
    "notes": "Supports detection of reporting failures when automated mechanisms (e.g., email, ticket, SIEM integration) are expected but not engaged."
  },
  "100021": {
    "description": "Vulnerabilities related to an incident were not reported or documented properly",
    "cjis": ["5.3.1"],
    "nist": ["IR-6(2)"],
    "policy_area": "Incident Response",
    "notes": "Detects failure to associate or report vulnerabilities discovered during incident handling. Requires correlation between vulnerability management and IR systems."
  },
  "100022": {
    "description": "Incident response assistance was unavailable or not accessible during an active incident",
    "cjis": ["5.3.1.1.1"],
    "nist": ["IR-7"],
    "policy_area": "Incident Response",
    "notes": "Supports detection of IR assistance gaps by flagging when incidents are triggered without accessible or active IR support personnel. Requires metadata from ticketing systems or alert correlation pipelines indicating `ir_support.available`."
  },
  "100023": {
    "description": "Automated incident response assistance mechanism failed to initiate during event handling",
    "cjis": ["5.3.1.1.1"],
    "nist": ["IR-7(1)"],
    "policy_area": "Incident Response",
    "notes": "Flags failed automation in IR support processes, such as playbook execution failure, untriggered alerts, or broken chatops pipelines. Depends on logs with fields like `automation.status` and `event.type=ir_support_trigger`."
  },
  "100024": {
    "description": "Lack of coordination between internal incident response team and external support providers",
    "cjis": ["5.3.1.1.2"],
    "nist": ["IR-7(2)"],
    "policy_area": "Incident Response",
    "notes": "Detects whether formal coordination or contact listing between internal IR team and third-party response partners is in place. Depends on logs with `coordination.status` fields or relationship audit metadata."
  },
  "100025": {
    "description": "Incident response policy or associated procedures are outdated or not reviewed as required",
    "cjis": ["5.3.2"],
    "nist": ["IR-1"],
    "policy_area": "Incident Response",
    "notes": "Flags outdated or missing reviews of incident response policies. Requires compliance, audit, or GRC system logs that include document name and status (e.g., `incident_response`, `outdated`)."
  },
  "100026": {
    "description": "Incident response plan is missing, outdated, or not reviewed and distributed after key events",
    "cjis": ["5.3.2"],
    "nist": ["IR-8"],
    "policy_area": "Incident Response",
    "notes": "Ensures the IR plan is up to date, reviewed, and shared appropriately. Depends on logs that track plan status such as 'outdated', 'reviewed', or 'distributed' from audit or compliance systems."
  },
  "100027": {
    "description": "Automated incident handling process failed or was not executed as expected",
    "cjis": ["5.3.2.1"],
    "nist": ["IR-4(1)"],
    "policy_area": "Incident Response",
    "notes": "Flags failure of automated mechanisms that support incident handling. Depends on logs from SOAR/playbook systems or automation frameworks, showing `event.type=incident_automation` and `automation.status=failed`."
  },
  "100028": {
    "description": "Incident handling was incomplete or failed to integrate lessons learned into training and procedures",
    "cjis": ["5.3.2.1"],
    "nist": ["IR-4"],
    "policy_area": "Incident Response",
    "notes": "Flags when incidents do not follow through containment → eradication → recovery → review, or when corrective actions from lessons learned are not integrated. Relies on logs tagged with `incident_review` and lifecycle status metadata."
  },
  "100029": {
    "description": "Automated incident tracking or analysis mechanism failed or was not operating during incident activity",
    "cjis": ["5.3.2.1"],
    "nist": ["IR-5(1)"],
    "policy_area": "Incident Response",
    "notes": "Detects failures in automated incident tracking, metadata enrichment, or data analysis processes. Relies on logs with `event.type=incident_tracking` and fields such as `tracking.status=failed`."
  },
  "100030": {
    "description": "No continuity of operations actions were taken for a critical class incident",
    "cjis": ["5.3.2.1"],
    "nist": ["IR-4(3)"],
    "policy_area": "Incident Response",
    "notes": "Triggers when a critical incident type occurs and no continuity-of-operations procedures were marked as executed. Requires structured logging of `incident.class` and `coop.triggered` from response or orchestration tools."
  },
  "100031": {
    "description": "Incident was not correlated with other relevant events or responses, reducing awareness",
    "cjis": ["5.3.2.1"],
    "nist": ["IR-4(4)"],
    "policy_area": "Incident Response",
    "notes": "This rule detects incidents that were logged or responded to in isolation, without connection to similar events. It depends on correlation metadata such as `correlation.status=none` being included in logs."
  },
  "100032": {
    "description": "Dynamic reconfiguration actions were not performed for designated systems during incident response",
    "cjis": ["5.3.2.1"],
    "nist": ["IR-4(2)"],
    "policy_area": "Incident Response",
    "notes": "Identifies failures to perform live system changes (e.g., network re-routing, ACL updates, port blocking) as part of IR response. Depends on structured logs with `reconfiguration.status=not_performed` or similar tracking."
  },
  "100033": {
    "description": "An incident occurred without being formally tracked or documented in the incident response system",
    "cjis": ["5.3.2.1"],
    "nist": ["IR-5"],
    "policy_area": "Incident Response",
    "notes": "Fires when a qualifying incident event is detected but no documentation or tracking action has been logged. Requires structured logs with `documentation.status` fields or equivalent evidence of IR workflow gaps."
  },
  "100034": {
    "description": "Audit logs were not reviewed within defined frequency or failed to escalate on threat input",
    "cjis": ["5.3.2.2"],
    "nist": ["AU-6"],
    "policy_area": "Incident Response",
    "notes": "Detects missing or overdue audit record reviews, or failure to increase review cadence after risk events. Relies on structured review status logs such as `review.status=overdue` and `event.type=audit_review`."
  },
  "100035": {
    "description": "Incident response training was not completed within the defined time period after onboarding or role change",
    "cjis": ["5.3.3"],
    "nist": ["IR-2"],
    "policy_area": "Incident Response",
    "notes": "This rule detects overdue incident response training for personnel in security roles. Requires structured logs such as `training.topic=incident_response` and `training.status=overdue`."
  },
  "100036": {
    "description": "Incident response test was not performed on schedule per defined testing cadence",
    "cjis": ["5.3.3"],
    "nist": ["IR-3"],
    "policy_area": "Incident Response",
    "notes": "Flags missing or overdue incident response exercises. Depends on structured logs like `event.type=ir_test` and `test.status=overdue` or equivalent."
  },
  "100037": {
    "description": "Audit logs were not retained for the time period required by policy",
    "cjis": ["5.3.4"],
    "nist": ["AU-11"],
    "policy_area": "Incident Response",
    "notes": "Checks whether logs are expired or purged before required retention. Expects audit metadata with `retention.status=violation` emitted from review tooling or storage lifecycle audit jobs."
  },
  "100038": {
    "description": "Audit log entry is missing or includes non-compliant timestamp (unsynced clock or no UTC/offset)",
    "cjis": ["5.4.1"],
    "nist": ["AU-8"],
    "policy_area": "Auditing and Accountability",
    "notes": "Time stamps must be UTC-based or include offset, with granularity per policy. Assumes audit logs include `timestamp.status=invalid` when validation fails."
  },
  "100039": {
    "description": "Audit log storage capacity is insufficient for compliance with retention policy",
    "cjis": ["5.4.1"],
    "nist": ["AU-4"],
    "policy_area": "Auditing and Accountability",
    "notes": "Assumes log data or agent monitors storage usage on audit log volume or disk mount. Alert triggers when disk threshold or audit log space capacity exceeds defined limit."
  },
  "100040": {
    "description": "Unauthorized access, modification, or deletion of audit logs or logging tools detected",
    "cjis": ["5.4.1"],
    "nist": ["AU-9"],
    "policy_area": "Auditing and Accountability",
    "notes": "Requires file integrity or audit trail monitoring on log directories and logging tool config files. Assumes audit.result reflects tampering or unauthorized deletion events."
  },
  "100041": {
    "description": "Audit logs stored on the same physical system being audited (non-compliant with separation requirement)",
    "cjis": ["5.4.1"],
    "nist": ["AU-9(2)"],
    "policy_area": "Auditing and Accountability",
    "notes": "Assumes audit log storage path is observable and taggable via agent logs, config scans, or enrichment. Ideal with FIM or log forwarding configuration validation."
  },
  "100042": {
    "description": "Audit logging process failure occurred without triggering required alert or remediation actions",
    "cjis": ["5.4.1"],
    "nist": ["AU-5"],
    "policy_area": "Auditing and Accountability",
    "notes": "Requires visibility into audit subsystem failure logs and confirmation of alert/response action (via field like alert.sent). Must ensure logging pipelines report failure events clearly."
  },
  "100043": {
    "description": "Audit records indicating anomalies were not reviewed or reported to appropriate personnel",
    "cjis": ["5.4.1"],
    "nist": ["AU-6"],
    "policy_area": "Auditing and Accountability",
    "notes": "This rule depends on visibility into audit logs flagged as anomalous or containing suspicious indicators. Alerting logic must check for unreviewed anomalies or failures to notify designated parties. Adaptable via log enrichment pipelines or correlation engines."
  },
  "100044": {
    "description": "Audit log storage volume exceeded threshold without issuing warning",
    "cjis": ["5.4.1"],
    "nist": ["AU-5(1)"],
    "policy_area": "Auditing and Accountability",
    "notes": "This rule assumes audit log utilization is tracked and logged as a percentage value. Failure to trigger a warning at a predefined threshold (e.g., 90%) represents non-compliance with AU-5(1). Alert logic should verify both condition (percent full) and alert status."
  },
  "100045": {
    "description": "Unauthorized user performed audit logging configuration actions",
    "cjis": ["5.4.1"],
    "nist": ["AU-9(4)"],
    "policy_area": "Auditing and Accountability",
    "notes": "This rule enforces that only members of a defined privileged user subset (e.g., audit_admins) can make changes to audit logging systems. It relies on logs that include both the action and user role, such as sudo logs, auditd config changes, or Wazuh OSQuery data."
  },
  "100046": {
    "description": "Audit record missing one or more required fields (e.g., session ID, source IP)",
    "cjis": ["5.4.1"],
    "nist": ["AU-3(1)"],
    "policy_area": "Auditing and Accountability",
    "notes": "This rule ensures audit records contain all organization-defined fields like user.session_id or src.ip. Triggered if logs are missing these contextual attributes. Enrichment may be required from endpoint agents or decoders."
  },
  "100047": {
    "description": "Audit logging failure triggered a real-time alert to designated personnel",
    "cjis": ["5.4.1"],
    "nist": ["AU-5(2)"],
    "policy_area": "Auditing and Accountability",
    "notes": "This rule ensures real-time alerts are generated when audit logging systems fail. Requires error capture from Wazuh modules or log daemons, and alerting must occur within organization-defined timeframes."
  },
  "100048": {
    "description": "Log entry missing required audit context fields such as event type, source, timestamp, actor, and result.",
    "cjis": ["5.4.1"],
    "nist": ["AU-3"],
    "policy_area": "Auditing and Accountability",
    "notes": "This rule detects incomplete audit entries, ensuring logs capture all required elements for compliance and forensic auditability. Relies on decoder validation or context-enrichment mechanisms to flag incompleteness."
  },
  "100049": {
    "description": "User was not presented with previous logon date/time at successful authentication.",
    "cjis": ["5.4.1"],
    "nist": ["AC-9"],
    "policy_area": "Auditing and Accountability",
    "notes": "Detects absence of user notification for prior logon on successful login events. Assumes log stream includes or can be enriched with a `last_logon.notified` boolean or corresponding event entry."
  },
  "100050": {
    "description": "Audit records are not being generated for required event types or components per AU-2 and AU-3 specifications.",
    "cjis": ["5.4.1"],
    "nist": ["AU-12"],
    "policy_area": "Auditing and Accountability",
    "notes": "Verifies audit record generation is active for defined event types. Assumes enrichment field `event.audit_generated` exists or equivalent detection method is in place."
  },
  "100051": {
    "description": "Audit records are not being correlated across repositories, limiting situational awareness across systems.",
    "cjis": ["5.4.1"],
    "nist": ["AU-6(3)"],
    "policy_area": "Auditing and Accountability",
    "notes": "Assumes enrichment field `audit.repo_count` is present to track whether logs are unified from multiple sources. Integration should support multi-source audit aggregation."
  },
  "100052": {
    "description": "Remote access is not being monitored through automated means, violating CJIS remote session control guidance.",
    "cjis": ["5.4.1.1"],
    "nist": ["AC-17(1)"],
    "policy_area": "Auditing and Accountability",
    "notes": "Triggers if remote access sessions are detected but no active monitoring service is confirmed. Assumes telemetry on remote access events and monitoring state is available."
  },
  "100053": {
    "description": "System monitoring failed to detect unauthorized activity or anomalies, violating CJIS system oversight obligations.",
    "cjis": ["5.4.1.1"],
    "nist": ["SI-4"],
    "policy_area": "Auditing and Accountability",
    "notes": "This rule assumes integration with behavioral analysis or alerting platforms that flag monitoring effectiveness. Triggered when detection fails against expected threats or conditions."
  },
  "100054": {
    "description": "Continuous monitoring is not active or lacks strategy compliance, violating CJIS 5.4.3.",
    "cjis": ["5.4.3"],
    "nist": ["CA-7"],
    "policy_area": "Auditing and Accountability",
    "notes": "Rule detects gaps in continuous monitoring plans or scheduled system metric reporting. Assumes event fields or telemetry can show monitoring status."
  },
  "100055": {
    "description": "System is missing critical audit event types required by CJIS 5.4.3, compromising forensic readiness.",
    "cjis": ["5.4.3"],
    "nist": ["AU-2"],
    "policy_area": "Auditing and Accountability",
    "notes": "Triggers when audit logs lack required categories (e.g., authentication, privilege use). Requires log inspection or config scan."
  },
  "100056": {
    "description": "Account lifecycle events (create, modify, disable, delete) are not audited, violating CJIS 5.4.1.1 and NIST AC-2(4).",
    "cjis": ["5.4.1.1"],
    "nist": ["AC-2(4)"],
    "policy_area": "Auditing and Accountability",
    "notes": "Monitors for automated logging of user account management events. Assumes normalized audit fields (e.g., audit.account.create). Requires log coverage across identity/auth sources (Active Directory, auditd, etc)."
  },
  "100057": {
    "description": "Audit record review and reporting are not integrated using automated mechanisms, as required by CJIS 5.4.3 and NIST AU-6(1).",
    "cjis": ["5.4.3"],
    "nist": ["AU-6(1)"],
    "policy_area": "Auditing and Accountability",
    "notes": "Triggers when logs are being collected but are not integrated into an automated process for audit review and reporting. Supports detection of compliance gaps in environments lacking SIEM, scheduled analysis, or Wazuh integration logic."
  },
  "100058": {
    "description": "Audit record reduction or report generation is not implemented or alters original logs, violating CJIS 5.4.3 and AU-7.",
    "cjis": ["5.4.3"],
    "nist": ["AU-7"],
    "policy_area": "Auditing and Accountability",
    "notes": "This rule detects environments where either (a) no reporting interface is available for audit review, or (b) audit data is manipulated during log reduction in ways that prevent accurate event reconstruction. Requires logging platform to support filtered views while preserving raw event integrity."
  },
  "100059": {
    "description": "Audit logs are not retained for the required duration per organizational or regulatory policy, in violation of CJIS 5.4.3 / AU-11.",
    "cjis": ["5.4.3"],
    "nist": ["AU-11"],
    "policy_area": "Auditing and Accountability",
    "notes": "This rule checks for inadequate audit retention settings, typically defined by `audit.retention.days`. CJIS typically requires logs to be retained for sufficient time to enable after-the-fact investigation, legal discovery, and compliance reviews. This threshold should match agency policy and legal obligations."
  },
  "100060": {
    "description": "Monitors and audits account creation, modification, disabling, and deletion in real-time. Required by CJIS 5.5.1 and NIST AC-2(4).",
    "cjis": ["5.5.1"],
    "nist": ["AC-2(4)"],
    "policy_area": "Access Control",
    "notes": "This rule ensures that all lifecycle events related to user accounts—such as creation, deletion, enabling, disabling, and password modifications—are captured via logs and evaluated for compliance. This is essential for detecting insider threats, policy violations, or misconfigurations. Assumes audit policies are enabled and relevant log sources are available to Wazuh."
  },
  "100061": {
    "description": "Tracks and enforces automatic disabling of user accounts that are expired, inactive, or policy-violating, aligning with CJIS 5.5.1 and NIST AC-2(3).",
    "cjis": ["5.5.1"],
    "nist": ["AC-2(3)"],
    "policy_area": "Access Control",
    "notes": "This rule maps to the requirement to disable accounts automatically if they are expired, inactive beyond a defined period, or no longer tied to a legitimate user. Assumes that systems maintain login timestamps and generate appropriate audit events when disablement occurs. Can be automated through Wazuh active response or linked to IAM lifecycle management policies. Monitoring disablement actions also improves audit visibility and reduces risk from dormant credentials."
  },
  "100062": {
    "description": "Comprehensive enforcement of account lifecycle controls including creation, modification, disabling, deletion, access reviews, and privilege validation, aligning with CJIS 5.5.1 and NIST AC-2.",
    "cjis": ["5.5.1"],
    "nist": ["AC-2"],
    "policy_area": "Access Control",
    "notes": "This rule ensures full coverage of account lifecycle management events from creation to disablement. It monitors group/role changes, authorization requirements, offboarding processes, and privileged access validation. Detects violations of account policies and missed access reviews through correlated event analysis. Recommended pairing with scheduled attestation audits, LDAP monitoring, and IAM integration."
  },
  "100063": {
    "description": "Enforcement of automated system account management processes via identity platforms, SCIM, LDAP, or other tools to fulfill CJIS AC-2(1) requirements.",
    "cjis": ["5.5.1"],
    "nist": ["AC-2(1)"],
    "policy_area": "Access Control",
    "notes": "This rule detects the presence and activity of automated account management mechanisms, including SCIM provisioning, LDAP synchronization, and identity orchestration tools such as Azure AD, Okta, or FreeIPA. It ensures account lifecycle actions are performed consistently, logged, and aligned with security and compliance policies. Automation logs are parsed to verify that no manual bypassing of account workflows is occurring."
  },
  "100064": {
    "description": "Detection of automated removal or disabling of temporary and emergency accounts per CJIS AC-2(2). Ensures short-lived accounts expire within the organization-defined period.",
    "cjis": ["5.5.1"],
    "nist": ["AC-2(2)"],
    "policy_area": "Access Control",
    "notes": "This rule identifies log entries associated with the automated expiration, disabling, or removal of temporary and emergency accounts. It is critical that organizations configure identity systems to auto-disable such accounts after pre-set durations, and that logs reflect these events for auditing. Manual intervention should be the exception, not the norm, for managing these accounts."
  },
  "100065": {
    "description": "Detects events associated with personnel termination and offboarding, including revocation of credentials, access disabling, and system lockouts. Required to satisfy CJIS PS-4.",
    "cjis": ["5.5.1"],
    "nist": ["PS-4"],
    "policy_area": "Access Control",
    "notes": "Control PS-4 ensures system access and credentials are revoked promptly following employment termination, and that security procedures (e.g., exit interviews, asset retrieval, data retention) are followed. This rule triggers on termination indicators and should be paired with alerting for delayed access revocation."
  },
  "100066": {
    "description": "Enforces and monitors logical access control decisions by detecting access denials, unauthorized attempts, or ACL enforcement failures. Supports CJIS AC-3 compliance.",
    "cjis": ["5.5.2"],
    "nist": ["AC-3"],
    "policy_area": "Access Control",
    "notes": "This rule identifies unauthorized or policy-violating access attempts to systems, files, or services. It supports enforcement of logical access policies and detects enforcement failures across identity platforms, OS-level ACLs, and system logs."
  },
  "100067": {
    "description": "Detects violations of the least privilege principle by monitoring unauthorized or unexplained elevation of privileges, special access use, or escalated session activities.",
    "cjis": ["5.5.2"],
    "nist": ["AC-6"],
    "policy_area": "Access Control",
    "notes": "This rule supports enforcement of least privilege by alerting on elevation attempts, admin role assignments, and processes acting with excessive privileges. Complementary reviews of group policy, IAM roles, and entitlement reviews should accompany this detection."
  },
  "100068": {
    "description": "Detects systems or applications that do not support or fail to properly implement user-initiated session logout capabilities, as required for authenticated communication sessions.",
    "cjis": ["5.5.2"],
    "nist": ["AC-12(1)"],
    "policy_area": "Access Control",
    "notes": "Supports user-driven security controls for session termination. Validates logout visibility and backend session invalidation. Part of broader access enforcement and authentication hygiene."
  },
  "100069": {
    "description": "Monitors for unauthorized or unreviewed discretionary access policy changes, including user-assigned privileges, ACL modifications, and inherited permission escalations.",
    "cjis": ["5.5.2"],
    "nist": ["AC-3(4)"],
    "policy_area": "Access Control",
    "notes": "Addresses discretionary privilege propagation and user-managed access risks. Useful for systems implementing NTFS, Linux POSIX permissions, or cloud-based ACLs."
  },
  "100070": {
    "description": "Monitors for mandatory access control (MAC) enforcement violations such as SELinux/AppArmor denials or unauthorized security label changes. Ensures CJIS data cannot be accessed, shared, or relabeled without policy compliance.",
    "cjis": ["5.5.2"],
    "nist": ["AC-3(3)"],
    "policy_area": "Access Control",
    "notes": "Requires strict enforcement of kernel-level MAC mechanisms. Exceptions must be explicit and logged. Works best when SELinux/AppArmor/Smack are configured and log forwarding is enabled."
  },
  "100071": {
    "description": "Detects when privileged accounts (e.g., root, domain admin) are used to perform nonsecurity or user-level functions, violating the separation of duties principle in AC-6(2).",
    "cjis": ["5.5.2"],
    "nist": ["AC-6(2)"],
    "policy_area": "Access Control",
    "notes": "This rule reinforces least privilege by requiring separate non-privileged accounts for general functions. Helps reduce risk from privilege escalation or malware delivered via insecure channels like web or email."
  },
  "100072": {
    "description": "Detects events related to the creation, assignment, or modification of privileged user accounts and roles. Satisfies CJIS control 5.5.2.1 (AC-2(7)).",
    "cjis": ["5.5.2.1"],
    "nist": ["AC-2(7)"],
    "policy_area": "Access Control",
    "notes": "Enforces structured management of privileged accounts. This rule flags role assignments, sudo/administrator membership changes, and privilege revocation events to support CJIS and NIST AC-2(7) compliance."
  },
  "100073": {
    "description": "Detects access attempts and modifications to security-critical functions or configurations by unauthorized or mis-assigned users. Aligns with CJIS control 5.5.2.1 (AC-6(1)).",
    "cjis": ["5.5.2.1"],
    "nist": ["AC-6(1)"],
    "policy_area": "Access Control",
    "notes": "Focuses on limiting access to security-relevant components like firewalls, audit logs, SELinux policies, and privileged functions. This rule flags unauthorized or unexpected changes as potential policy violations."
  },
  "100074": {
    "description": "Flags violations of defined concurrent session limits across user accounts, including remote, local, and application-specific logins. Enforces CJIS control 5.5.2.1 (AC-10).",
    "cjis": ["5.5.2.1"],
    "nist": ["AC-10"],
    "policy_area": "Access Control",
    "notes": "Helps implement concurrent session caps based on user role or access method (e.g., max 1 SSH session per admin). Prevents session sprawl, enforces session traceability, and mitigates lateral attack risks."
  },
  "100075": {
    "description": "Monitors unauthorized assignment or use of privileged accounts such as root, sudo, or domain admin. Enforces CJIS control 5.5.2.1 (AC-6(5)).",
    "cjis": ["5.5.2.1"],
    "nist": ["AC-6(5)"],
    "policy_area": "Access Control",
    "notes": "Tracks the creation, modification, or usage of privileged accounts to ensure only authorized personnel hold administrative access. Detects role escalation and improper additions to elevated groups."
  },
  "100076": {
    "description": "Flags the use of privileged accounts in vulnerability scanning contexts. Supports enforcement of CJIS control 5.5.2.1 (RA-5(5)).",
    "cjis": ["5.5.2.1"],
    "nist": ["RA-5(5)"],
    "policy_area": "Access Control",
    "notes": "Detects usage of root/admin credentials for vulnerability scanning tools. Ensures that such activities are authorized, controlled, and auditable. Helps enforce scanning boundaries and protects against unauthorized use of elevated scan permissions."
  },
  "100077": {
    "description": "Monitors and flags activities that violate the separation of duties by detecting cross-role behavior or privilege misuse. Supports enforcement of CJIS control 5.5.2.1 (AC-5).",
    "cjis": ["5.5.2.1"],
    "nist": ["AC-5"],
    "policy_area": "Access Control",
    "notes": "This rule supports enforcement of separation of duties by identifying scenarios where a single user attempts to perform multiple conflicting privileged actions (e.g., user creation and audit review). Supports role-based access boundary detection through log correlation, with assumptions of a structured RBAC model in place."
  },
  "100078": {
    "description": "Detects insecure password behaviors such as weak passwords, insecure transmission, or improper password storage. Enforces CJIS 5.5.3 requirements for password-based authentication.",
    "cjis": ["5.5.3"],
    "nist": ["IA-5(1)"],
    "policy_area": "Access Control",
    "notes": "Covers detection and enforcement of secure password creation, storage, and transmission practices per CJIS and NIST IA-5(1). Supports denylist enforcement, secure hash storage, password complexity policies, and immediate reset post-recovery."
  },
  "100079": {
    "description": "Detects lack of login banners or system use notifications in violation of CJIS 5.5.4 / AC-8. Ensures users acknowledge consent to monitoring and proper usage warnings before access.",
    "cjis": ["5.5.4"],
    "nist": ["AC-8"],
    "policy_area": "Access Control",
    "notes": "Banners must explicitly state legal use limitations, consent to monitoring, auditability, and public use restrictions. Applies to both internal and publicly accessible systems. Detection assumes logs contain banner enforcement metadata or warnings on absence."
  },
  "100080": {
    "description": "Detects unauthorized public-facing content or activity in violation of AC-22. Enforces CJIS requirements for limiting publishing to trained, designated users and pre/post content review for nonpublic data.",
    "cjis": ["5.5.4"],
    "nist": ["AC-22"],
    "policy_area": "Access Control",
    "notes": "Control requires public content publishing to be restricted to designated individuals, with pre-release review and regular audits to remove any accidentally posted sensitive or restricted information. Training logs, publishing authorization lists, and content review schedules must be documented."
  },
  "100081": {
    "description": "Detects idle or manually-locked sessions in alignment with CJIS AC-11. Requires a device lock after inactivity or when users leave systems unattended, and enforces reauthentication for access resumption.",
    "cjis": ["5.5.5"],
    "nist": ["AC-11"],
    "policy_area": "Access Control",
    "notes": "Organizations must implement workstation and mobile device session lock mechanisms. This includes automatic lockout after inactivity (e.g., 10 minutes) and policies requiring manual locking. Authentication procedures to regain access must match organizational standards (e.g., password, MFA, CAC). Policy enforcement should be validated through event logs, device configuration profiles, and endpoint compliance reports."
  },
  "100082": {
    "description": "Enforces CJIS 5.5.6 (AC-17) by detecting and verifying remote access activity, ensuring each connection method is pre-authorized, securely configured, and properly documented per organizational policy.",
    "cjis": ["5.5.6"],
    "nist": ["AC-17"],
    "policy_area": "Access Control",
    "notes": "Organizations must implement written remote access policies detailing which technologies are allowed, connection requirements (VPN, MFA, encryption), and usage restrictions. Each remote access method must be authorized before use, with monitoring in place to detect unapproved access paths. Log collection and review should validate compliance through remote session metadata."
  },
  "100083": {
    "description": "Enforces CJIS 5.5.6 (AC-17(3)) by ensuring remote sessions are routed through authorized and centrally-managed network access control points such as VPN concentrators, firewalls, jump hosts, or ZTNA gateways.",
    "cjis": ["5.5.6"],
    "nist": ["AC-17(3)"],
    "policy_area": "Access Control",
    "notes": "All remote access activity must pass through vetted and auditable control mechanisms that can enforce connection policies, log access metadata, and ensure segmentation and role-based restrictions. Bypass methods (e.g., split tunneling, unmanaged devices) must be blocked or require explicit approval and risk documentation."
  },
  "100084": {
    "description": "Implements CJIS 5.5.6 (AC-17(4)) by restricting remote execution of privileged commands to auditable, justified sessions and requiring inclusion of rationale in the system security plan.",
    "cjis": ["5.5.6"],
    "nist": ["AC-17(4)"],
    "policy_area": "Access Control",
    "notes": "All elevated remote access must be traceable through session recording, command logging, or console capture tools. Remote privilege should only be permitted for documented needs and tracked within the SSP with scope, duration, and role-based approval."
  },
  "100085": {
    "description": "Implements CJIS 5.5.6 (AC-17(1)) by requiring automated monitoring and technical enforcement of all remote access methods, including session tracking, alerting, and automated termination.",
    "cjis": ["5.5.6"],
    "nist": ["AC-17(1)"],
    "policy_area": "Access Control",
    "notes": "All remote access must be auditable and technically enforceable via automated mechanisms. Examples include VPN session tracking, real-time alerts for unexpected access, and conditional access policies. Manual review alone is insufficient for compliance."
  },
  "100086": {
    "description": "Implements CJIS 5.5.6 (SI-4) by enforcing real-time monitoring of the system to detect unauthorized access, attack indicators, and anomalous behavior across remote and local connections. Provides for legal review, risk-driven tuning, and structured reporting.",
    "cjis": ["5.5.6"],
    "nist": ["SI-4"],
    "policy_area": "Access Control",
    "notes": "This rule emphasizes a proactive and multi-layered monitoring strategy using automated tools. Coverage must include IDS/IPS, endpoint telemetry, behavioral analytics, and VPN session analysis. Monitoring locations must be strategically and adaptively selected, and legal guidance obtained when needed."
  },
  "100087": {
    "description": "Implements CJIS 5.5.6 (AC-17(6)) by ensuring remote access mechanism configurations and details are not disclosed or exposed to unauthorized users. Supports protection of VPN, RDP, SSH, and remote management interfaces.",
    "cjis": ["5.5.6"],
    "nist": ["AC-17(6)"],
    "policy_area": "Access Control",
    "notes": "The rule mandates tight confidentiality around remote access systems. Unauthorized access to this data can enable threat actors to bypass security controls. A zero-trust and RBAC-driven access model should be enforced, and all access attempts should be logged and monitored with alerts on anomalies."
  },
  "100088": {
    "description": "Implements CJIS 5.5.6 (AC-17(2)) by ensuring that all remote access sessions are encrypted using modern cryptographic protocols. Protects confidentiality and integrity of data in transit from MITM and interception threats.",
    "cjis": ["5.5.6"],
    "nist": ["AC-17(2)"],
    "policy_area": "Access Control",
    "notes": "Encryption mechanisms such as TLS, IPSec, and SSH are required to protect remote sessions from eavesdropping and tampering. Regular protocol audits and SIEM alerts should be configured to detect unencrypted traffic or insecure cipher usage."
  },
  "100089": {
    "description": "Implements CJIS 5.5.6.1 (AC-20) by controlling or prohibiting the use of external systems to access, store, or process CJI. Either prohibits external access or requires security controls such as encryption, endpoint management, and written authorization.",
    "cjis": ["5.5.6.1"],
    "nist": ["AC-20"],
    "policy_area": "Access Control",
    "notes": "Enforces restrictions or access conditions for personally owned or unmanaged external systems. Recommended enforcement includes signed BYOD agreements, full-disk encryption, antivirus, VPN+MFA, and remote wipe capability. Violations must be logged and investigated."
  },
  "100090": {
    "description": "Enforces CJIS 5.6.1 (IA-2(5)) by requiring individual authentication before access to shared/group accounts. Prevents anonymous or untraceable shared account use and ensures auditability.",
    "cjis": ["5.6.1"],
    "nist": ["IA-2(5)"],
    "policy_area": "Identification and Authentication",
    "notes": "This control supports traceability and audit logging when group credentials are necessary. All access must be attributable to an individual identity. Shared or anonymous logins should be prevented unless wrapped in per-user session initiation processes (e.g., login shells, PAM, smartcard auth, or MFA)."
  },
  "100091": {
    "description": "Implements CJIS 5.6.1 (IA-1) requiring a formalized identification and authentication policy, supporting procedures, assignment of responsible official, and a defined review/update cycle. Enables policy governance for authentication systems.",
    "cjis": ["5.6.1"],
    "nist": ["IA-1"],
    "policy_area": "Identification and Authentication",
    "notes": "This foundational control ensures the organization's IA framework is documented, accountable, and actively reviewed. Without these governance elements, downstream authentication safeguards cannot be validated or maintained."
  },
  "100092": {
    "description": "Implements CJIS 5.6.1.1 (AC-3), requiring enforcement of approved authorizations for logical access to data systems and CJI resources, based on mapped policies and identities including ORI.",
    "cjis": ["5.6.1.1"],
    "nist": ["AC-3"],
    "policy_area": "Access Control",
    "notes": "This control requires all logical access be granted only through pre-approved authorization policies. Systems must verify ORI identity relationships and policy scope before granting access to any controlled interface or data set."
  },
  "100093": {
    "description": "Implements CJIS 5.6.2 (IA-3), enforcing unique identification and authentication of defined devices before allowing local, remote, or network connections.",
    "cjis": ["5.6.2"],
    "nist": ["IA-3"],
    "policy_area": "Identification and Authentication",
    "notes": "Covers the requirement for uniquely identifying and authenticating devices before establishing any type of connection to sensitive systems. Typical strategies include mutual TLS, device certificates, MDM validation, or NAC enforcement. This rule detects failures or bypass attempts."
  },
  "100094": {
    "description": "Implements CJIS 5.6.2 (IA-2(8)), requiring replay-resistant authentication mechanisms for both privileged and non-privileged accounts.",
    "cjis": ["5.6.2"],
    "nist": ["IA-2(8)"],
    "policy_area": "Identification and Authentication",
    "notes": "Covers replay resistance to prevent session hijacking and credential reuse attacks. Enforcement strategies include MFA, PKI, challenge-response protocols, and mutual TLS. Detection relies on access logs and behavioral analysis for token reuse or replay signatures."
  },
  "100095": {
    "description": "Implements CJIS 5.6.2 (IA-2), requiring unique identification and authentication for all organizational users and associating their identity with actions and processes they initiate.",
    "cjis": ["5.6.2"],
    "nist": ["IA-2"],
    "policy_area": "Identification and Authentication",
    "notes": "This control mandates individual user identification and authentication. The rule detects access attempts lacking unique IDs or involving generic/shared credentials. Ensures audit traceability and supports identity attribution for compliance and investigations."
  },
  "100096": {
    "description": "Implements CJIS 5.6.2.1 (IA-6), requiring the suppression of authentication feedback to prevent unauthorized individuals from exploiting system responses.",
    "cjis": ["5.6.2.1"],
    "nist": ["IA-6"],
    "policy_area": "Identification and Authentication",
    "notes": "Authentication interfaces must obscure all feedback that could reveal the validity of credentials to attackers. This includes obfuscating input, suppressing differentiating error messages, and ensuring UI and log feedback cannot be leveraged for account enumeration or guessing."
  },
  "100097": {
    "description": "Implements CJIS 5.6.2.1.1 (IA-5(1)), enforcing secure password creation, transmission, recovery, and storage.",
    "cjis": ["5.6.2.1.1"],
    "nist": ["IA-5(1)"],
    "policy_area": "Identification and Authentication",
    "notes": "Covers all password-based authentication lifecycle events. Emphasizes screening passwords against common lists, secure hashing, immediate password reset post-recovery, support for passphrases, and use of complexity enforcement mechanisms. Also includes protections against outdated or insecure storage/transmission practices."
  },
  "100098": {
    "description": "Implements CJIS 5.6.2.1.1 (IA-5) by ensuring secure authenticator lifecycle management including verification, rotation, revocation, protection, and default credential removal.",
    "cjis": ["5.6.2.1.1"],
    "nist": ["IA-5"],
    "policy_area": "Identification and Authentication",
    "notes": "This rule enforces procedures and technical controls for issuing, protecting, and revoking system authenticators. It ensures strong credentials are used, rotated regularly, and not reused or left as defaults. Group/shared account handling and unauthorized access detection are also monitored."
  },
  "100099": {
    "description": "Implements CJIS 5.6.2.1.2 (IA-2(2)) by enforcing Multi-Factor Authentication (MFA) for all non-privileged accounts, integrating factors such as PINs, tokens, or biometrics to secure access.",
    "cjis": ["5.6.2.1.2"],
    "nist": ["IA-2(2)"],
    "policy_area": "Identification and Authentication",
    "notes": "This rule ensures MFA is in place for all non-privileged users. PINs may be one component, but the rule requires two or more distinct factors to mitigate account compromise. Trigger events include MFA failure, OTP rejection, token misuse, or audit log indicators of bypassed or absent MFA enforcement."
  },
  "100100": {
    "description": "Implements CJIS 5.6.2.1.2 (IA-2(1)) by requiring Multi-Factor Authentication (MFA) for all privileged accounts. Privileged access must not be granted unless a valid combination of at least two authentication factors is validated.",
    "cjis": ["5.6.2.1.2"],
    "nist": ["IA-2(1)"],
    "policy_area": "Identification and Authentication",
    "notes": "This rule targets administrator and high-privilege user accounts. It validates that MFA is consistently enforced, especially during logins that could lead to elevated control over infrastructure. Log parsing must account for role or group-based privilege detection, and correlated authentication events that either confirm or omit a second factor."
  },
  "100101": {
    "description": "Implements CJIS 5.6.2.2 (IA-5(2)) for secure public key authentication, enforcing private key protections, identity mapping, and full certificate validation using PKI. Ensures systems validate revocation status and cache certificate metadata appropriately.",
    "cjis": ["5.6.2.2"],
    "nist": ["IA-5(2)"],
    "policy_area": "Identification and Authentication",
    "notes": "This rule ensures all public key authentication methods validate certificate trust chains and enforce cryptographic protections. Local and cloud-based authentication systems must maintain revocation integrity and traceability for audit and forensic purposes."
  },
  "100102": {
    "description": "Implements CJIS 5.6.2.2 (IA-2(13)) by requiring out-of-band authentication using a separate communication channel for identity verification under defined high-risk conditions.",
    "cjis": ["5.6.2.2"],
    "nist": ["IA-2(13)"],
    "policy_area": "Identification and Authentication",
    "notes": "This control mitigates risk from single-channel credential attacks. Organizations must define both the conditions for OOB enforcement and the acceptable mechanisms. Monitoring should include failure to complete OOB token confirmation and audit log gaps in OOB challenge issuance."
  },
  "100103": {
    "description": "Implements CJIS 5.6.2.2 (IA-3(1)) by requiring bidirectional, cryptographically-based authentication between organization-defined devices and remote/local/network systems before a connection is established.",
    "cjis": ["5.6.2.2"],
    "nist": ["IA-3(1)"],
    "policy_area": "Identification and Authentication",
    "notes": "This control ensures both endpoints of a connection can verify each other using cryptographic means. Authentication failures from mutual TLS, certificate mismatch, incomplete trust chains, or invalid key exchanges are relevant log triggers."
  },
  "100104": {
    "description": "Implements CJIS 5.6.2.2 (SC-12) by requiring secure and auditable management of cryptographic keys, covering generation, distribution, access, storage, and destruction as per organizational policy.",
    "cjis": ["5.6.2.2"],
    "nist": ["SC-12"],
    "policy_area": "Identification and Authentication",
    "notes": "Cryptographic key failures are among the highest security risks when improperly handled. This control ensures compliance with lifecycle-based key security practices and integrity checks. It assumes access to crypto module logs and HSM/PKI systems where applicable."
  },
  "100105": {
    "description": "Implements CJIS 5.6.2.2 (MA-4) by enforcing secure and documented procedures for remote maintenance, requiring approval, strong authentication, session auditing, and termination controls.",
    "cjis": ["5.6.2.2"],
    "nist": ["MA-4"],
    "policy_area": "Identification and Authentication",
    "notes": "This rule ensures all remote/nonlocal maintenance sessions are formally approved, use strong authentication, and follow session lifecycle policies. It detects violations such as unmonitored RDP access, maintenance without tickets, or access via unauthorized tools."
  },
  "100106": {
    "description": "Implements CJIS 5.6.3 (IA-12) by requiring identity proofing for system access, including user uniqueness, identity assurance level adherence, and evidence verification.",
    "cjis": ["5.6.3"],
    "nist": ["IA-12"],
    "policy_area": "Identification and Authentication",
    "notes": "Ensures each system user is uniquely identity-proofed using validated documentation and linked directly to a personal identifier, supporting auditability and non-repudiation. Detects shared/generic accounts and account creation without verified identity."
  },
  "100107": {
    "description": "Implements CJIS 5.6.3 (IA-5(8)) by requiring controls to manage risks when users maintain accounts on multiple systems.",
    "cjis": ["5.6.3"],
    "nist": ["IA-5(8)"],
    "policy_area": "Identification and Authentication",
    "notes": "Detects situations where one individual holds multiple accounts across distinct systems or services, enabling enforcement of security controls to mitigate account compromise risk. Organizations may define specific policies including IAM, SSO, or account usage audits."
  },
  "100108": {
    "description": "Implements CJIS 5.6.3.1 (AC-2(3)) by enforcing disablement of accounts under conditions such as expiration, policy violations, or prolonged inactivity.",
    "cjis": ["5.6.3.1"],
    "nist": ["AC-2(3)"],
    "policy_area": "Account Management",
    "notes": "Triggers based on account expiration, user separation, or inactivity policies. Should be integrated with IAM/IdP systems and monitored through log events related to account status changes. Helps enforce least privilege and reduce credential exposure."
  },
  "100109": {
    "description": "Implements CJIS 5.6.3.2 (IA-5(6)) by enforcing protection of authenticators based on the sensitivity of systems and data they secure.",
    "cjis": ["5.6.3.2"],
    "nist": ["IA-5(6)"],
    "policy_area": "Authenticator Management",
    "notes": "Monitors for events indicating improper handling or storage of credentials, such as plaintext secrets, leaked tokens, or unencrypted private keys. Intended to enforce credential protection aligned with data/system sensitivity classifications. Should be paired with logging from DLP, IAM, and credential vaulting systems."
  },
  "100110": {
    "description": "Implements CJIS 5.7.1 (CM-3) by detecting unauthorized configuration changes and verifying enforcement of formal configuration change controls.",
    "cjis": ["5.7.1"],
    "nist": ["CM-3"],
    "policy_area": "Configuration Management",
    "notes": "Monitors logs for config changes not tied to approved workflows. Works best with File Integrity Monitoring (FIM), Security Configuration Assessment (SCA), and asset inventory delta tracking. Ensures compliance with the requirement to document, review, approve, and track all configuration-controlled changes across the environment."
  },
  "100111": {
    "description": "Implements CJIS 5.7.1.1 (CM-8(3)) by detecting and responding to unauthorized hardware, software, and firmware components using automated tools.",
    "cjis": ["5.7.1.1"],
    "nist": ["CM-8(3)"],
    "policy_area": "Configuration Management",
    "notes": "Supports least functionality and baseline integrity by ensuring all system components are authorized and expected. Alert triggers include unknown software, unrecognized MACs, unapproved firmware, or mismatch with authorized configuration baselines. Integration with NAC/EDR/SIEM highly recommended for actionable response."
  },
  "100112": {
    "description": "Implements CJIS 5.7.1.1 (CM-7(2)) by preventing the execution of unauthorized programs in alignment with approved software lists and organizational access agreements.",
    "cjis": ["5.7.1.1"],
    "nist": ["CM-7(2)"],
    "policy_area": "Configuration Management",
    "notes": "Supports least functionality enforcement by restricting system execution to only explicitly approved programs. Detects or blocks unauthorized software via application control tools like AppLocker, WDAC, or EDR. Execution policies are enforced based on rules of behavior, acceptable use policies, and third-party access agreements."
  },
  "100113": {
    "description": "Implements CJIS 5.7.1.2 (SC-7(4)) by enforcing traffic flow controls and interface protections for all external telecommunications services.",
    "cjis": ["5.7.1.2"],
    "nist": ["SC-7(4)"],
    "policy_area": "Configuration Management",
    "notes": "Ensures external connections are filtered, logged, encrypted, and policy-enforced. Detects unapproved control-plane traffic and boundary bypass attempts. Logs should be generated by firewalls, routers, IDS, or managed interfaces. Alerts indicate unauthorized or misrouted communication violating predefined traffic flow policies."
  },
  "100114": {
    "description": "Implements CJIS 5.7.2 (CM-8) by ensuring a documented, accurate, and regularly updated inventory of all system components.",
    "cjis": ["5.7.2"],
    "nist": ["CM-8"],
    "policy_area": "Configuration Management",
    "notes": "Inventory must avoid duplicate or stale entries, reflect actual system state, and support accountability. Alerts should be triggered when components are observed in use (e.g., via logs or scans) but are not present or updated in the system inventory. Assumes CMDB, scanner, or similar tooling is in place."
  },
  "100115": {
    "description": "Implements CJIS 5.7.2 (SA-5) by requiring and monitoring the existence of current system and user documentation for all components and services.",
    "cjis": ["5.7.2"],
    "nist": ["SA-5"],
    "policy_area": "Configuration Management",
    "notes": "This rule ensures that administrative and user documentation exists, is complete, and distributed. It also covers fallback procedures when vendor/system documentation cannot be obtained. Helps reduce misconfigurations and improve security posture."
  },
  "100116": {
    "description": "Implements CJIS 5.7.2 (MA-5) by ensuring only authorized maintenance personnel perform work on systems, and that supervision is enforced for all others.",
    "cjis": ["5.7.2"],
    "nist": ["MA-5"],
    "policy_area": "Configuration Management",
    "notes": "Helps ensure maintenance activities are secure and traceable. All personnel must be vetted and authorized; others must be supervised. This reduces the risk of unauthorized changes or exploitation during maintenance windows."
  },
  "100117": {
    "description": "Implements CJIS 5.7.2 (MA-2) by ensuring all system maintenance is scheduled, approved, documented, and sanitized before any equipment is removed or replaced.",
    "cjis": ["5.7.2"],
    "nist": ["MA-2"],
    "policy_area": "Configuration Management",
    "notes": "Ensures secure handling of maintenance activities. Requires formal documentation, proper offsite approvals, sanitization of media, and post-maintenance control validation. Supports forensic accountability and audit readiness."
  },
  "100118": {
    "description": "Implements CJIS 5.7.2 (CM-5) by enforcing logical and physical access controls for any configuration change operations.",
    "cjis": ["5.7.2"],
    "nist": ["CM-5"],
    "policy_area": "Configuration Management",
    "notes": "Requires pre-approved, role-based access enforcement for system changes. Detects and alerts on violations such as unprivileged modifications, changes outside of maintenance windows, or lack of change authorization."
  },
  "100119": {
    "description": "Implements CJIS 5.7.2 (CM-5(1)) by enforcing access restrictions via automated mechanisms and logging all enforcement decisions.",
    "cjis": ["5.7.2"],
    "nist": ["CM-5(1)"],
    "policy_area": "Configuration Management",
    "notes": "Triggers on access control denials and policy enforcement events from OS security mechanisms or endpoint protection agents. Satisfies the requirement for non-discretionary access controls and audit visibility."
  },
  "100120": {
    "description": "Implements CJIS 5.7.2 (SA-4) by verifying that acquisition contracts explicitly contain security and privacy functional, assurance, documentation, and supply chain risk management requirements.",
    "cjis": ["5.7.2"],
    "nist": ["SA-4"],
    "policy_area": "Configuration Management",
    "notes": "Monitors acquisition and procurement workflows for absence or deficiency of required security clauses. Supports supply chain accountability and third-party risk reduction. Best used in tandem with periodic contract review events or compliance dashboards."
  },
  "100121": {
    "description": "Implements CJIS 5.8.1 (MP-2) by monitoring and enforcing restrictions on access to organization-defined digital and non-digital media. Triggers on unauthorized or denied access events, both logical and physical.",
    "cjis": ["5.8.1"],
    "nist": ["MP-2"],
    "policy_area": "Media Protection",
    "notes": "Supports auditing and response for both digital and non-digital media. Use with logs from endpoint DLP, access control systems, and manual audit records for physical media. Regular review and update of authorized personnel and access lists is essential."
  },
  "100122": {
    "description": "Implements CJIS 5.8.1 (MP-5) by enforcing strict controls and documentation for the transport of system media outside of controlled areas. Ensures all transport activities are logged, accountability is maintained, and only authorized personnel may conduct media transport.",
    "cjis": ["5.8.1"],
    "nist": ["MP-5"],
    "policy_area": "Media Protection",
    "notes": "Supports audit and compliance for all types of media transport, both logical and physical. Enforces chain-of-custody, encryption, and personnel authorization requirements. Event sources should include sign-out logs, courier manifests, SIEM/DLP removable media monitoring, and incident management systems."
  },
  "100123": {
    "description": "Implements CJIS 5.8.3 (MA-2) by enforcing strict documentation, oversight, and secure sanitization of digital media and system components during all maintenance, repair, and disposal activities. Ensures all removals and sanitizations are approved, logged, and validated.",
    "cjis": ["5.8.3"],
    "nist": ["MA-2"],
    "policy_area": "Media Protection",
    "notes": "Covers digital media, storage devices, and system components. All movement and maintenance are approved, recorded, and verified for proper sanitization prior to leaving secure areas. Suitable event sources include maintenance logs, SIEM events for data destruction, and chain-of-custody records."
  },
  "100124": {
    "description": "Implements CJIS 5.9.1 (MA-5) by enforcing authorization, access control, and active supervision of all maintenance personnel. Ensures only approved individuals can perform maintenance, with appropriate oversight and documentation for any exceptions.",
    "cjis": ["5.9.1"],
    "nist": ["MA-5"],
    "policy_area": "Physical Protection",
    "notes": "Covers internal and third-party maintenance staff. Supervisors must be assigned for non-cleared maintenance personnel. All access must be authorized and verifiable. Suitable event sources: access control, ticketing, SIEM, and physical security logs."
  },
  "100125": {
    "description": "Implements CJIS 5.9.1 (PE-3) by requiring comprehensive physical access control, logging, and device/key management for all CJIS facilities. Ensures only authorized individuals gain access and that all access, visitor, and device management events are auditable.",
    "cjis": ["5.9.1"],
    "nist": ["PE-3"],
    "policy_area": "Physical Protection",
    "notes": "Applies to all facility entry/exit points, public areas, visitors, and access devices. Audit logs must be maintained, and all device/key losses or changes documented and managed."
  },
  "100126": {
    "description": "Implements CJIS 5.9.1 (PE-5) by requiring strict physical access control to organization-defined output devices (e.g., printers, fax machines, copiers, display monitors, external media writers) to prevent unauthorized individuals from obtaining sensitive output. Alerts on unauthorized retrievals, unattended output, or access policy violations.",
    "cjis": ["5.9.1"],
    "nist": ["PE-5"],
    "policy_area": "Physical Protection",
    "notes": "Requires organizations to define and document all output devices subject to access control. Assumes integration with physical security event logs, print server/device logs, and helpdesk/security incident reports. Risks include unauthorized disclosure of CJI or PII, regulatory violations, and audit failures."
  },
  "100127": {
    "description": "Implements CJIS 5.9.1 (PE-3(3)) by requiring and monitoring continuous (24x7) human guard presence at all organization-defined physical access points to facilities where CJIS systems reside. Detects gaps in guard coverage, unmanned access points, and incidents of unauthorized access due to absence of security staff.",
    "cjis": ["5.9.1"],
    "nist": ["PE-3(3)"],
    "policy_area": "Physical Protection",
    "notes": "Applies only to access points defined by the organization as requiring 24x7 guard coverage. Assumes integration with guard logs, staffing schedules, physical access logs, and incident management systems. Risks include unauthorized access or security incidents due to unmanned entry points."
  },
  "100128": {
    "description": "Implements CJIS 5.9.1 (PE-2(1)) by requiring and monitoring that physical access to CJIS facilities is strictly authorized by up-to-date position or role. Triggers on access attempts by unauthorized or outdated roles, ensures access lists are synchronized with HR changes, and supports auditability.",
    "cjis": ["5.9.1"],
    "nist": ["PE-2(1)"],
    "policy_area": "Physical Protection",
    "notes": "Requires integration of access control logs with HR/role management systems for real-time updates. Alerts on access by terminated, transferred, or unauthorized roles. Uses <if_sid> to correlate with foundational access control alerts, minimizing false positives."
  },
  "100129": {
    "description": "Implements CJIS 5.9.1 (PE-6) by requiring continuous monitoring and scheduled/ad hoc reviews of physical access to CJIS facilities. Alerts on unauthorized access, security incidents, and ensures coordination with incident response. Enforces organization-defined log review frequency and event triggers.",
    "cjis": ["5.9.1"],
    "nist": ["PE-6"],
    "policy_area": "Physical Protection",
    "notes": "Organization must document log review schedule and define events that require ad hoc review. Rule assumes integration of access logs, alarm/CCTV events, and incident response workflows. Uses <if_sid> to correlate with base physical access rule and reduce false positives."
  },
  "100130": {
    "description": "Implements CJIS 5.9.1 (PE-8) by ensuring visitor access to CJIS facilities is fully recorded, reviewed at defined intervals, and that anomalies are reported to designated personnel. Alerts on missing/incomplete records, overdue reviews, and reporting failures.",
    "cjis": ["5.9.1"],
    "nist": ["PE-8"],
    "policy_area": "Physical Protection",
    "notes": "Organization must define retention periods, review frequency, and personnel for reporting. Assumes integration with visitor log systems, review tracking, and escalation processes. Uses <if_sid> for correlation with base physical access rule to reduce false positives."
  },
  "100131": {
    "description": "Implements CJIS 5.9.1 (PE-4) by controlling and monitoring physical access to organization-defined system distribution and transmission lines using documented security controls. Detects unauthorized access, tampering, alarm events, and control failures.",
    "cjis": ["5.9.1"],
    "nist": ["PE-4"],
    "policy_area": "Physical Protection",
    "notes": "Organization must define protected transmission/distribution lines and applicable security controls. Rule assumes integration with physical security, access, and tamper alarm logs. Uses <if_sid> to correlate with base physical access control events."
  },
}
